MOVE SPACES TO WS-CUSTOMER-NAME.

IF CUSTOMER-NAME-IN IS NULL OR CUSTOMER-NAME-IN = SPACES
    DISPLAY "Customer name is missing." 
    GO TO 1000-END.
ELSE
    MOVE CUSTOMER-NAME-IN TO WS-CUSTOMER-NAME
END-IF.

1000-END. EXIT PROGRAM.